#!/usr/bin/env bash


grep 'ينايركانون' *.arb
grep 'فبرايرشباط' *.arb
grep 'مارسآذار' *.arb
grep 'مارساذار' *.arb
grep 'نيسانابريل' *.arb
grep 'مايوأيار' *.arb
grep 'مايوايار' *.arb
grep 'يونيوحزيران' *.arb
grep 'يوليوتموز' *.arb
grep 'آباغسطس' *.arb
grep 'آبأغسطس' *.arb
grep 'اباغسطس' *.arb
grep 'ابأغسطس' *.arb
grep 'سبتمبرأيلول' *.arb
grep 'سبتمبرايلول' *.arb
grep 'أكتوبرتشرين' *.arb
grep 'اكتوبرتشرين' *.arb
grep 'نوفمبرتشرين' *.arb
grep 'ديسمبركانون' *.arb


for c in *.arb
do
nohup sed -i \
-e 's/ينايركانون/يناير كانون/g' \
-e 's/فبرايرشباط/فبراير شباط/g' \
-e 's/مارسآذار/مارس آذار/g' \
-e 's/مارساذار/مارس اذار/g' \
-e 's/نيسانابريل/نيسان ابريل/g' \
-e 's/مايوأيار/مايو أيار/g' \
-e 's/مايوايار/مايو ايار/g' \
-e 's/يونيوحزيران/يونيو حزيران/g' \
-e 's/يوليوتموز/يوليو تموز/g' \
-e 's/آباغسطس/آب اغسطس/g' \
-e 's/آبأغسطس/آب أغسطس/g' \
-e 's/اباغسطس/اب اغسطس/g' \
-e 's/ابأغسطس/اب أغسطس/g' \
-e 's/سبتمبرأيلول/سبتمبر أيلول/g' \
-e 's/سبتمبرايلول/سبتمبر ايلول/g' \
-e 's/أكتوبرتشرين/أكتوبر تشرين/g' \
-e 's/اكتوبرتشرين/اكتوبر تشرين/g' \
-e 's/نوفمبرتشرين/نوفمبر تشرين/g' \
-e 's/ديسمبركانون/ديسمبر كانون/g' \
${c} &
done


